doc/mm4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-26 Sun 13:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marty McGowan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge2c773a">1. MM4 &#x2013; Markdown with M4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="leanpub">leanpub</span>&#xa0;<span class="markua">markua</span>&#xa0;<span class="markdown">markdown</span>&#xa0;<span class="gruber">gruber</span></span></a>
<ul>
<li><a href="#org02b2258">1.1. What is MM4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="m4">m4</span></span></a></li>
<li><a href="#org2a889c1">1.2. How Achieved</a>
<ul>
<li><a href="#org4dc9d73">1.2.1. Two Features to Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="include">include</span>&#xa0;<span class="header">header</span>&#xa0;<span class="name">name</span>&#xa0;<span class="awk">awk</span>&#xa0;<span class="anchor">anchor</span></span></a></li>
<li><a href="#orge3eaf50">1.2.2. The Solution</a></li>
<li><a href="#orgcec3e5f">1.2.3. The Header Macro</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge2c773a" class="outline-2">
<h2 id="orge2c773a"><span class="section-number-2">1</span> MM4 &#x2013; Markdown with M4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="leanpub">leanpub</span>&#xa0;<span class="markua">markua</span>&#xa0;<span class="markdown">markdown</span>&#xa0;<span class="gruber">gruber</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://leanpub.com">Leanpub</a> is now (since 2018) using a flavor of Markdown they call
Markua.  It is upwardly compatible with <a href="https://daringfireball.net/projects/markdown/">Gruber Markdown</a> with the sole
exception that it doesn't accept embedded HTML.  MM4 solves the
problem, accepting the Markua view that those HTML constructs that
Gruber doesn't handle can be fit into a simplifying syntactic
framework.  The MM4 solution is an author-centric view, allowing the
user to transform their current Gruber Markdown on an as-needed basis
to Markua.  The practice established here adopts the view that neither
is the last word in text editing and formatting.
</p>
</div>

<div id="outline-container-org02b2258" class="outline-3">
<h3 id="org02b2258"><span class="section-number-3">1.1</span> What is MM4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="m4">m4</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
MM4 is a shell function, wrapping the m4 command, with a set of
definitions to emit either Gruber Markdown or Markua with a
command-line option.  The design interface at the moment is:
</p>


<pre class="example">
$ mm4 [--define=_gruber] file ...  # OR
$ mm4 --define=_markua file ...  

</pre>


<p>
The square brackets indicate the default format. Either the Gruber or
Markua format of the output shows up on the <b>stdout</b>.
</p>
</div>
</div>

<div id="outline-container-org2a889c1" class="outline-3">
<h3 id="org2a889c1"><span class="section-number-3">1.2</span> How Achieved</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This is the function.  It uses the <code>m4</code> command, a macro processor which
converts user definitions which map text argument into the desired format
</p>

<pre class="example">
mm4 () 
{ 
    cmd=${1:-m4};
    shift;
    ${cmd} $(include)/{hacks,underscore,local}.m4 $*
}

</pre>

<p>
At the moment, there are two places where I'm reprocessing text in a
near-Gruber format into a working Gruber format.
</p>
</div>

<div id="outline-container-org4dc9d73" class="outline-4">
<h4 id="org4dc9d73"><span class="section-number-4">1.2.1</span> Two Features to Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="include">include</span>&#xa0;<span class="header">header</span>&#xa0;<span class="name">name</span>&#xa0;<span class="awk">awk</span>&#xa0;<span class="anchor">anchor</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
First, Gruber doesn't include files from other sources into the output
stream.  Since I'm writing the Shell Functions book at the moment, there
are places where I'd like to include a shell fragment, followed by it's
resulting output.  A few years ago I'd picked up a generic include processor,
whose syntax admits <code>@include ../path/to/thisfile.suf</code> for example.  Of course,
it's a recursive process allowing nested includes. 
</p>

<p>
Also, Gruber doesn't do anything special with the names or labels of it's
sections.  So, I'd pre-process those as well, turning something like
</p>

<pre class="example">
### Level Three Header

</pre>

<p>
into 
</p>

<pre class="example">
&lt;a name="level-three-header"&gt;
### Level Three Header
&lt;/a&gt;

</pre>

<p>
which allows in-document reference to this section.  At the moment, since
Markua is a work in progress, here's what this would look like in Markua:
</p>

<pre class="example">
 {id: three-level-header}
### Level Three Header

</pre>

<p>
In the next paragraph in the <a href="https://leanpub.com/markua"> Markua Manual</a>, it says:
</p>

<p>
&gt; This syntax is intended to be reminiscent of HTML anchor tags, not of <code>h1</code> titles in Markua
</p>

<p>
At the moment, I handle this with a shell function <code>labify</code>, basically
an <b><b>awk</b></b> script to recognize the leading ##s and emit the prior text
above.
</p>

<p>
Since my threshold of pain is three, these two instances suggest the
threshold isn't far off in upgrades to Markdown which anticipate
Markua.   
</p>

<p>
At the moment, these repairs are in separate locations in the process,
both in terms of implementation language and processes.  Here's the function
which MaKes the HyperText:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #0000ff;">mkht</span> ()
{
     : convert a {default, the newest} Markdown into HTML copy
     <span style="color: #483d8b;">set</span> -- ${<span style="color: #a0522d;">1</span>:-$(<span style="color: #ff00ff;">ls</span> -t *.md| sed 1q)}
     <span style="color: #483d8b;">set</span> $<span style="color: #a0522d;">1</span>  ../ch$(<span style="color: #ff00ff;">chno</span>)_$<span style="color: #a0522d;">1</span> ${<span style="color: #a0522d;">1</span>%.md}<span style="color: #483d8b;">.</span>{html,inc}
     app_trace $<span style="color: #a0522d;">*</span>
     backup_lib mklib
     newest $<span style="color: #a0522d;">3</span> $<span style="color: #a0522d;">1</span> *.sh *.run $(<span style="color: #ff00ff;">llib</span>)/references.txt &amp;&amp; <span style="color: #a020f0;">return</span>
     app_trace  <span style="color: #8b2252;">"about to: markdown $1 &gt; $2"</span>
     include $<span style="color: #a0522d;">1</span> | tee $<span style="color: #a0522d;">4</span> | labify | tee $<span style="color: #a0522d;">2</span> |  markdown - &gt; $<span style="color: #a0522d;">3</span>
}
</pre>
</div>

<p>
This is the crucial line:
</p>

<pre class="example">
include $1 | tee $4 | labify | tee $2 |  markdown - &gt; $3

</pre>

<p>
The second <code>set</code> command assigns these positional parameters:
</p>

<ol class="org-ol">
<li><b>somename</b>.md</li>
<li>../chNN_ <b>somename</b>.md</li>
<li><b>somename</b>.html</li>
<li><b>somename</b>.inc</li>
</ol>

<p>
The include process resolves the <code>@include</code> directives in the *.md file,
leaving the result in the *.inc file, adding the <code>name</code> labels, leaving the
result in the parent directory, where it becomes the source of the Leanpub
source document, and further runs (Gruber) <code>markdown</code> on the input, with the
result in the local *.html file
</p>

<p>
The <code>newest</code> command, a bit of <code>make</code> process expect the *.html file to be the 
newest of its arguments, the *.md file, any *.{sh,run} files in the directory
and a file of references in the local library.
</p>

<p>
Using mm4 to combine these two repairs in a single process would look like:
</p>

<pre class="example">
mm4 $1 | tee $2 | markdown - &gt; $3

</pre>

<p>
Not only to simplify upgrading the process to include other features.
</p>
</div>
</div>




<div id="outline-container-orge3eaf50" class="outline-4">
<h4 id="orge3eaf50"><span class="section-number-4">1.2.2</span> The Solution</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
The <code>@include</code> feature is directly absorbed into <b>mm4</b> with the
<code>_include</code> m4 builtin.  If you are somewhat familiar with m4, you know
about it's <code>include</code> builtin.  mm4 uses a set of hacks which map all
the builtin definitions onto an underscore prefix-named definition.
This frees up ordinary and common programming words to not be consumed
by the processor.
</p>

<p>
The <code>labify</code> feature will have to find it's way into the definitions.
It's interface will look like this:
</p>

<pre class="example">
_labify( text to labify[, optional trailing text])

</pre>

<p>
A header macro which whose interface is:
</p>

<pre class="example">
_H( [level,] Heading text)

</pre>

<p>
Since <code>labify</code> is probably trivial (in Markua, certainly) the <code>header</code>
macro needs more careful specification.
</p>
</div>
</div>

<div id="outline-container-orgcec3e5f" class="outline-4">
<h4 id="orgcec3e5f"><span class="section-number-4">1.2.3</span> The Header Macro</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
The last argument is the text to display. An optional first argument
specifies the heading <b>level</b>.   Here's a first cut at the requirements
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">level</th>
<th scope="col" class="org-left">means</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">absent, blank, or empty</td>
<td class="org-left">use current header level</td>
</tr>

<tr>
<td class="org-left">N, e.g. 1,2,3</td>
<td class="org-left">Nth level header</td>
</tr>

<tr>
<td class="org-left">+, "push"</td>
<td class="org-left">Increment the level</td>
</tr>

<tr>
<td class="org-left">-, "pop"</td>
<td class="org-left">decrement the level by one</td>
</tr>

<tr>
<td class="org-left">-N</td>
<td class="org-left">decrement the level by N</td>
</tr>

<tr>
<td class="org-left">"recall" (speculative)</td>
<td class="org-left">increment the level counter at this level</td>
</tr>

<tr>
<td class="org-left">#{1,N)   (an RE)</td>
<td class="org-left">Nth Level, assumes Markdown/Markua</td>
</tr>

<tr>
<td class="org-left">*{1,N)   (an RE)</td>
<td class="org-left">Nth Level, assumes OrgMode</td>
</tr>

<tr>
<td class="org-left">the very first encounter</td>
<td class="org-left">Assume First Level</td>
</tr>
</tbody>
</table>


<p>
A question remains: are the <code>push</code> and <code>pop</code> operations, pre- or post-
operations.  For the moment, I think both push is a POST operation,
and pop is PRE.  It may be possible for a user to specify, or have
other words, like "first", "last", at a given level, where "recall"
would be an alternate value of "first".
</p>

<p>
The absent, blank, or empty level would allow a header, named HDR, say
to be used list this:
</p>

<pre class="example">
HDR( #, First first-level header)
HDR( Second first-level header)
HDR( Third first-level header)
HDR( Fourth first-level header)

</pre>

<p>
Then, suppose you were about to import a bunch of headers from 
a file discussing 3rd level properties;
</p>

<pre class="example">
HDR( one good thing)
HDR( a better thing)
HDR( the best thing)
HDR( the absolute best)

</pre>

<p>
Simply insert the latter file into the buffer of the first:
</p>

<pre class="example">
HDR( #, First first-level header)
HDR( Second first-level header)
HDR( push, Third first-level header)
HDR(    one good thing)
HDR(    a better thing)
HDR(    the best thing)
HDR(    the absolute best)
HDR( pop, Fourth first-level header)

</pre>

<p>
The importance of a consistent header treatment allows
the repeated use, not just the copy-paste operation, of 
this approach
</p>

<pre class="example">
HDR( #, First first-level header)
HDR( Second first-level header)
HDR( push, Third first-level header)
INCLUDE( discussing 3rd level properties.txt)
HDR( recall, Fourth first-level header)

</pre>

<p>
Note, use of "recall" is probably indicated in this case, 
since the author of the enclosing file needn't know the
structure of the included file.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marty McGowan</p>
<p class="date">Created: 2019-05-26 Sun 13:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
